{
  "navigation": {
    "home": "Главная",
    "projects": "Проекты",
    "about": "О мне",
    "contact": "Контакты"
  },
  "cookieBanner": {
    "message": "Мы используем файлы cookie для улучшения работы нашего сайта.",
    "learnMore": "Узнать больше",
    "accept": "Принять",
    "decline": "Отклонить"
  },
  "cookiesPolicy": {
    "title": "Политика использования файлов cookie",
    "description": "Мы используем файлы cookie для улучшения функциональности нашего сайта. Cookie помогают нам анализировать, как пользователи взаимодействуют с сайтом, и позволяют его совершенствовать. Cookie также могут использоваться в маркетинговых целях и для персонализации контента.",
    "types": {
      "title": "Какие файлы cookie мы используем?",
      "necessary": "Необходимые файлы cookie (например, для аутентификации пользователей).",
      "analytics": "Аналитические файлы cookie (например, для анализа трафика с помощью Google Analytics).",
      "preferences": "Файлы cookie для настроек и персонализации (например, сохранение языка, предпочтений пользователя).",
      "marketing": "Маркетинговые файлы cookie (например, для показа персонализированной рекламы)."
    },
    "management": {
      "title": "Как управлять файлами cookie?",
      "description": "Вы можете в любой момент изменить настройки файлов cookie в браузере или воспользоваться опциями управления cookie на нашем сайте (если такая функция доступна)."
    },
    "moreInfo": "Если вы хотите узнать больше о том, как мы обрабатываем данные, ознакомьтесь с нашей",
    "privacyPolicyLink": "политикой конфиденциальности"
  },
  "privacyPolicy": {
    "title": "Политика конфиденциальности",
    "description": "Мы уважаем вашу конфиденциальность и обязуемся защищать ваши персональные данные. Данная Политика конфиденциальности объясняет, как мы собираем, используем и защищаем ваши данные при использовании нашего сайта.",
    "dataCollection": {
      "title": "Какие данные мы собираем",
      "description": "Мы собираем следующие типы данных:",
      "technicalData": "Технические данные: IP-адрес, браузер, устройство, а также аналитические данные из Google Analytics."
    },
    "dataUsage": {
      "title": "Цели сбора данных",
      "description": "Мы используем ваши данные для:",
      "analytics": "Анализа трафика с помощью Google Analytics для улучшения работы сайта.",
      "improvement": "Повышения качества и функциональности нашего веб-сайта."
    },
    "cookiesUsage": {
      "title": "Использование файлов cookie",
      "description": "Наш сайт использует файлы cookie для анализа трафика с помощью Google Analytics. Вы можете настроить браузер так, чтобы он отклонял файлы cookie, но это может повлиять на функциональность сайта."
    },
    "policyChanges": {
      "title": "Изменения в Политике конфиденциальности",
      "description": "Мы оставляем за собой право обновлять данную политику. Все изменения будут публиковаться на этой странице, в том числе в отношении использования аналитических инструментов, таких как Google Analytics."
    }
  },
  "home": {
    "title": "Привет! Я Алексей, Front-End разработчик из Польши, в настоящее время ищу удалённую работу на полный рабочий день. Большинство проектов в моём портфолио построены на CMS Drupal, но у меня также есть коммерческий опыт разработки веб-приложений с использованием Next.js и React."
  },
  "contact": {
    "title": "Контакт",
    "description": "Если у вас есть вопросы или предложения по сотрудничеству, вы можете отправить их мне через форму обратной связи ниже.",
    "name": "Имя и фамилия",
    "email": "Email",
    "message": "Сообщение",
    "submit": "Отправить",
    "required": "Это поле обязательно для заполнения!",
    "messageMin": "Ваш текст слишком короткий, минимальная длина — 3 символа.",
    "messageMax": "Ваш текст слишком длинный, максимальная длина — 60 символов.",
    "messageEmail": "Введите корректный адрес электронной почты.",
    "messageMinText": "Ваш текст слишком короткий, минимальная длина — 20 символов.",
    "messageMaxText": "Ваш текст слишком длинный, максимальная длина — 400 символов.",
    "statusStart": "Отправка",
    "statusEnd": "Отправить"
  },
  "about": {
    "title": "Обо мне",
    "first": {
      "title": "Общая информация",
      "description": "Я Full Stack Developer (или Front-End Developer) среднего уровня с уверенным опытом работы с такими технологиями, как JavaScript, SCSS и HTML. Также работал с TypeScript, React, Next.js, Nest.js и Tailwind CSS. Имею практический опыт работы с CMS, включая Drupal (версии 7-10) и частично с WordPress. Я совмещаю навыки программирования с пониманием UX/UI, что позволяет мне создавать интуитивно понятные, эстетичные и эффективные веб-сайты и приложения."
    },
    "second": {
      "title": "Лет",
      "description": "опыта работы в IT"
    },
    "three": {
      "description": "Много лет работаю с CMS Drupal, приобрел опыт в создании и кастомизации веб-сайтов. Работал с разными версиями Drupal (от 7 до 10), что позволило мне освоить как разработку пользовательских тем и модулей, так и управление контентом. Гибкость Drupal дала возможность реализовывать проекты разного уровня сложности, адаптируя их под уникальные требования клиентов."
    },
    "four": {
      "title": "Работал с"
    },
    "five": {
      "title": "Знание языков",
      "pol": "Польский",
      "levelPol": "Продвинутый",
      "eng": "Английский",
      "levelEng": "Базовый",
      "rus": "Русский",
      "levelRus": "Родной",
      "ukr": "Украинский",
      "levelUkr": "Родной"
    }
  },
  "petProjects": {
    "apartments": {
      "name": "Apartments",
      "description": "Веб-платформа для продажи квартир с функцией фильтрации, добавления объявлений и управления предложениями. Приложение разработано с использованием Next.js, React, Prisma и Tailwind."
    },
    "pixem": {
      "name": "Pixem",
      "description": "Пет-проект для автоматического конвертирования значений, например, из px в rem, построен на Next.js и React."
    },
    "weather": {
      "name": "Weather pet project",
      "description": "Многоязычное погодное приложение, использующее данные openweathermap.org. Разработано с React, Mobx и SCSS."
    },
    "departments": {
      "name": "Departments",
      "description": "Приложение для управления зарплатами в командах. Построено на Vue 2 и Firebase."
    }
  },
  "workProjects": {
    "newTermaheat": {
      "name": "Новый корпоративный сайт Termaheat (отопительная продукция)",
      "description": "Я отвечаю за фронтенд и некоторые бэкенд-функции при создании сайта, основываясь на макетах из Figma."
    },
    "testingApp": {
      "name": "Веб-приложение для тестирования и оценки знаний",
      "description": "Я разработал и внедрил систему оценки знаний после курсов, позволяющую создавать тесты, анализировать результаты и генерировать отчёты для компании Polkar."
    },
    "contactTermaheat": {
      "name": "Корпоративный сайт TermaHeat (отопительная продукция)",
      "description": "Я работал над фронтендом контактных страниц в различных языковых версиях на основе макетов Figma, реализовав интерактивную карту Польши и Германии."
    },
    "termaplay": {
      "name": "Корпоративный сайт Termaplay (медицинская продукция)",
      "description": "Отвечал за полную реализацию проекта – фронтенд и бэкенд, мультиязычность, интеграцию CMS Drupal 9 и добавление карты Google с фильтрацией устройств."
    },
    "termaReh": {
      "name": "Корпоративный сайт TermaReh (реабилитационные устройства)",
      "description": "Полная реализация проекта – фронтенд, бэкенд, мультиязычность, интеграция CMS Drupal 9 и реализация карты Google с фильтрацией устройств."
    },
    "newTermaMed": {
      "name": "Корпоративный сайт TermaMed",
      "description": "Я реализовал фронтенд и бэкенд, внедрив мультиязычность и интеграцию с CMS Drupal 9."
    },
    "termaServices": {
      "name": "Корпоративный сайт TermaServices",
      "description": "Отвечал за полную реализацию проекта – фронтенд и бэкенд, мультиязычность, интеграцию CMS Drupal 8 и обновление до Drupal 10."
    },
    "termaDrilling": {
      "name": "Корпоративный сайт TermaDrilling (строительная техника)",
      "description": "Полная реализация проекта – фронтенд и бэкенд, мультиязычность, интеграция CMS Drupal 9 и обновление сайта до Drupal 10."
    },
    "termaFiber": {
      "name": "Корпоративный сайт TermaFiber (строительная техника)",
      "description": "Мультиязычный сайт, созданный на Vue 2 на основе макета Figma. Я реализовал проект полностью самостоятельно."
    },
    "termaSmart": {
      "name": "Лендинг TermaSmart",
      "description": "Создал мультиязычный лендинг на основе макета Figma. Реализовал проект самостоятельно."
    },
    "oldTermaMed": {
      "name": "Корпоративный сайт TermaMed",
      "description": "Я реализовал фронтенд и бэкенд, включая переработку страниц продуктов и списка продуктов, с частичными изменениями в бэкенде."
    },
    "lux2": {
      "name": "Продуктовая страница Lux2",
      "description": "Я работал над фронтендом страницы в соответствии с макетом Figma."
    },
    "ue": {
      "name": "Страница 'Гранты Европейского Союза'",
      "description": "Я работал над фронтендом страниц 'Кто мы' и 'Гранты ЕС'."
    },
    "dropShip": {
      "name": "Продуктовая страница DROP SHIP Heating Elements",
      "description": "Я реализовал фронтенд страницы, основываясь на макетах Figma."
    },
    "fundacion": {
      "name": "Сайт Pomorska Fundacja Bracia Mniejsi",
      "description": "Я реализовал полный сайт – фронтенд и бэкенд, создав его на WordPress."
    }
  }
}