{
  "navigation": {
    "home": "Головна",
    "projects": "Проєкти",
    "about": "Про мене",
    "contact": "Контакти"
  },
  "cookieBanner": {
    "message": "Ми використовуємо файли cookie для покращення роботи нашого сайту.",
    "learnMore": "Дізнатися більше",
    "accept": "Прийняти",
    "decline": "Відхилити"
  },
  "cookiesPolicy": {
    "title": "Політика використання файлів cookie",
    "description": "Ми використовуємо файли cookie для покращення функціональності нашого сайту. Файли cookie допомагають нам аналізувати, як користувачі взаємодіють із сайтом, і дозволяють його вдосконалювати. Cookie також можуть використовуватися в маркетингових цілях та для персоналізації контенту.",
    "types": {
      "title": "Які файли cookie ми використовуємо?",
      "necessary": "Необхідні файли cookie (наприклад, для автентифікації користувачів).",
      "analytics": "Аналітичні файли cookie (наприклад, для аналізу трафіку за допомогою Google Analytics).",
      "preferences": "Файли cookie для налаштувань і персоналізації (наприклад, збереження мови, уподобань користувача).",
      "marketing": "Маркетингові файли cookie (наприклад, для показу персоналізованої реклами)."
    },
    "management": {
      "title": "Як керувати файлами cookie?",
      "description": "Ви можете будь-коли змінити налаштування файлів cookie у своєму браузері або скористатися опціями керування cookie на нашому сайті (якщо така функція доступна)."
    },
    "moreInfo": "Якщо ви хочете дізнатися більше про те, як ми обробляємо дані, ознайомтеся з нашою",
    "privacyPolicyLink": "політикою конфіденційності"
  },
  "privacyPolicy": {
    "title": "Політика конфіденційності",
    "description": "Ми поважаємо вашу конфіденційність і зобов’язуємося захищати ваші персональні дані. Ця Політика конфіденційності пояснює, як ми збираємо, використовуємо та захищаємо ваші дані під час використання нашого веб-сайту.",
    "dataCollection": {
      "title": "Які дані ми збираємо",
      "description": "Ми збираємо такі типи даних:",
      "technicalData": "Технічні дані: IP-адреса, браузер, пристрій, а також аналітичні дані з Google Analytics."
    },
    "dataUsage": {
      "title": "Цілі збору даних",
      "description": "Ми використовуємо ваші дані для:",
      "analytics": "Аналізу трафіку за допомогою Google Analytics для покращення сайту.",
      "improvement": "Підвищення якості та функціональності нашого веб-сайту."
    },
    "cookiesUsage": {
      "title": "Використання файлів cookie",
      "description": "Наш сайт використовує файли cookie для аналізу трафіку за допомогою Google Analytics. Ви можете налаштувати браузер так, щоб він відхиляв файли cookie, але це може вплинути на функціональність сайту."
    },
    "policyChanges": {
      "title": "Зміни в Політиці конфіденційності",
      "description": "Ми залишаємо за собою право оновлювати цю політику. Усі зміни будуть опубліковані на цій сторінці, зокрема щодо використання аналітичних інструментів, таких як Google Analytics."
    }
  },
  "home": {
    "title": "Привіт! Я Олексій, Front-End розробник з Польщі, наразі шукаю віддалену роботу на повний робочий день. Більшість проєктів у моєму портфоліо створені на CMS Drupal, але я також маю комерційний досвід розробки веб-застосунків з використанням Next.js і React."
  },
  "contact": {
    "title": "Контакт",
    "description": "Якщо у вас є питання або пропозиції щодо співпраці, ви можете надіслати їх мені через контактну форму нижче.",
    "name": "Ім'я та прізвище",
    "email": "Email",
    "message": "Повідомлення",
    "submit": "Надіслати",
    "required": "Це поле є обов’язковим!",
    "messageMin": "Ваш текст занадто короткий, мінімальна довжина — 3 символи.",
    "messageMax": "Ваш текст занадто довгий, максимальна довжина — 60 символів.",
    "messageEmail": "Введіть коректну електронну адресу.",
    "messageMinText": "Ваш текст занадто короткий, мінімальна довжина — 20 символів.",
    "messageMaxText": "Ваш текст занадто довгий, максимальна довжина — 400 символів.",
    "statusStart": "Надсилання",
    "statusEnd": "Надіслати"
  },
  "about": {
    "title": "Про мене",
    "first": {
      "title": "Загальна інформація",
      "description": "Я Full Stack Developer (або Front-End Developer) середнього рівня з впевненим досвідом роботи з такими технологіями, як JavaScript, SCSS і HTML. Також працював із TypeScript, React, Next.js, Nest.js і Tailwind CSS. Маю практичний досвід роботи з CMS, зокрема Drupal (версії 7-10) та частково з WordPress. Поєдную навички програмування із знаннями UX/UI, що дозволяє мені створювати інтуїтивно зрозумілі, естетичні та ефективні веб-сайти та застосунки."
    },
    "second": {
      "title": "Років",
      "description": "досвіду в IT."
    },
    "three": {
      "description": "Багато років працюю з CMS Drupal, набув досвіду у створенні та кастомізації веб-сайтів. Працював із різними версіями Drupal (від 7 до 10), що дозволило мені опанувати як розробку користувацьких тем і модулів, так і керування контентом. Гнучкість Drupal дала змогу реалізовувати проєкти різного рівня складності, адаптуючи їх під унікальні потреби клієнтів."
    },
    "four": {
      "title": "Працював з"
    },
    "five": {
      "title": "Знання мов",
      "pol": "Польська",
      "levelPol": "Просунутий",
      "eng": "Англійська",
      "levelEng": "Базовий",
      "rus": "Російська",
      "levelRus": "Рідна",
      "ukr": "Українська",
      "levelUkr": "Рідна"
    }
  },
  "petProjects": {
    "apartments": {
      "name": "Apartments",
      "description": "Веб-платформа для продажу квартир з фільтрацією, розміщенням оголошень та управлінням пропозиціями. Створена з використанням Next.js, React, Prisma та Tailwind."
    },
    "pixem": {
      "name": "Pixem",
      "description": "Пет-проєкт для автоматичного перетворення значень, наприклад, px у rem. Створений з використанням Next.js і React."
    },
    "weather": {
      "name": "Weather pet project",
      "description": "Багатомовний додаток для перегляду погоди, що використовує дані з openweathermap.org. Створений з використанням React, MobX і SCSS."
    },
    "departments": {
      "name": "Departments",
      "description": "Додаток для управління зарплатами команди. Створений з використанням Vue 2 та Firebase."
    }
  },
  "workProjects": {
    "newTermaheat": {
      "name": "Нова корпоративна сторінка Termaheat (опалювальні продукти)",
      "description": "Я відповідаю за фронтенд і вибрані функціональності бекенду при створенні сайту, ґрунтуючись на макетах з Figma."
    },
    "testingApp": {
      "name": "Веб-застосунок для тестування знань",
      "description": "Я спроєктував і реалізував систему оцінки знань після курсів, яка дозволяє створювати тести, аналізувати результати та генерувати звіти для компанії Polkar."
    },
    "contactTermaheat": {
      "name": "Корпоративна сторінка TermaHeat (опалювальні продукти)",
      "description": "Я працював над фронтендом підсторінок для різних мовних версій на основі макетів з Figma, реалізувавши інтерактивну мапу Польщі та Німеччини."
    },
    "termaplay": {
      "name": "Корпоративна сторінка Termaplay (медичні продукти)",
      "description": "Я відповідав за повну реалізацію проєкту – фронтенд і бекенд, багатомовність, інтеграцію CMS Drupal 9 та додавання Google-мапи з фільтром пристроїв."
    },
    "termaReh": {
      "name": "Корпоративна сторінка TermaReh (реабілітаційне обладнання)",
      "description": "Повна реалізація проєкту – фронтенд, бекенд, багатомовність, інтеграція CMS Drupal 9 та реалізація Google-мапи з фільтром пристроїв."
    },
    "newTermaMed": {
      "name": "Корпоративна сторінка TermaMed",
      "description": "Я реалізував фронтенд і бекенд, включаючи багатомовність та інтеграцію з CMS Drupal 9."
    },
    "termaServices": {
      "name": "Корпоративна сторінка TermaServices",
      "description": "Відповідав за повну реалізацію проєкту – фронтенд і бекенд, багатомовність, інтеграцію CMS Drupal 8 та оновлення до Drupal 10."
    },
    "termaDrilling": {
      "name": "Корпоративна сторінка TermaDrilling (будівельні машини)",
      "description": "Повна реалізація проєкту – фронтенд і бекенд, багатомовність, інтеграція CMS Drupal 9 та оновлення до Drupal 10."
    },
    "termaFiber": {
      "name": "Корпоративна сторінка TermaFiber (будівельні машини)",
      "description": "Багатомовний сайт, створений на Vue 2 на основі макету з Figma. Проєкт виконав самостійно."
    },
    "termaSmart": {
      "name": "Лендінг TermaSmart",
      "description": "Створення багатомовної лендінг-сторінки на основі макету з Figma. Проєкт виконав самостійно."
    },
    "oldTermaMed": {
      "name": "Корпоративна сторінка TermaMed",
      "description": "Реалізував фронтенд і бекенд, включаючи реконструкцію підсторінок продуктів і списку товарів із частковими змінами в бекенді."
    },
    "lux2": {
      "name": "Продуктова підсторінка Lux2",
      "description": "Працював над фронтендом підсторінки згідно з макетом Figma."
    },
    "ue": {
      "name": "Підсторінка Європейські дотації",
      "description": "Працював над фронтендом підсторінок 'Хто ми є' та 'Європейські дотації'."
    },
    "dropShip": {
      "name": "Продуктова підсторінка DROP SHIP Heating Elements",
      "description": "Реалізував фронтенд підсторінки, ґрунтуючись на макетах з Figma."
    },
    "fundacion": {
      "name": "Сайт Поморського фонду Bracia Mniejsi",
      "description": "Я реалізував повний сайт – фронтенд і бекенд, створений на WordPress."
    }
  }
}